app/controllers/static_controller.rb

SELECT  `urls`.* FROM `urls`  WHERE `urls`.`short_code` IS NULL LIMIT 1
---
  def index
    @short_code = params[:short_code]
    new_url = Url.find_by short_code: @short_code