app/controllers/urls_controller.rb

  def index
    @urls = Url.all
---
SELECT `urls`.* FROM `urls`

def longify
@short_code = params[:short_code]
@search = Url.find_by_short_code(@short_code)
---
SELECT  `urls`.* FROM `urls`  WHERE `urls`.`short_code` = '60p' LIMIT 1

  def create

    # Instantiate a new object using form parameters
    @url = Url.new(params.require(:url).permit(:long_url))
    @long_url = @url.long_url

    @url.ip_address = request.remote_ip
    # Save the object
@search = Url.find_by_long_url(@long_url)
if !@search.blank?
@old_url = Url.find_by long_url: @long_url
@old_id = @old_url.id

@old_short_code = @old_id = @old_url.short_code
redirect_to root_url(:short_code => @old_short_code), :notice => 'Your short URL has been created'

else

    if @url.save
    @new_url = Url.find_by long_url: @long_url
    @id = @new_url.id
    @short_code = (@id.to_s + (1+69).to_s).reverse.to_i.to_s(36)
    @new_url.update({:short_code => @short_code})
---
SELECT  `urls`.* FROM `urls`  WHERE `urls`.`long_url` = 'sdg' LIMIT 1
INSERT INTO `urls` (`created_at`, `ip_address`, `long_url`, `updated_at`) VALUES ('2014-07-29 02:21:21', '127.0.0.1', '', '2014-07-29 02:21:21')
UPDATE `urls` SET `short_code` = 'm5', `updated_at` = '2014-07-29 18:51:00' WHERE `urls`.`id` = 79